AUTO_config_TK_pesok/src/Catalogs/РолиСервисДеск/РолиСервисДеск.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РолиСервисДеск</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Создание</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Выполнение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Закрытие</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипРоли</name>
    <type>
      <types>EnumRef.ТипыРолейСотрудников</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Сотрудники</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>DefinedType.Посетители</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Оборудование</name>
    <attributes>
      <name>Оборудование</name>
      <type>
        <types>CatalogRef.ОборудованиеПоставщиков</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

AUTO_config_TK_pesok/src/Catalogs/ТорговыеПлощадки/ТорговыеПлощадки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТорговыеПлощадки</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>Global_ID</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеКомпании</name>
    <comment>Подразделение компании в котором был выписан документ</comment>
    <type>
      <types>CatalogRef.ПодразделенияКомпании</types>
    </type>
  </attributes>
  <attributes>
    <name>GLN</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистрации</name>
    <comment>Используется при анализе первичного интереса</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РегистрироватьТК</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОткрытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗакрытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазделятьТоварыПоОрганизациям</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистрацияОС_ТекущиеОстатки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТерриторияПоКОАТУУ</name>
    <comment>Название и код территории по КОАТУУ, на которой расположен торговая точка</comment>
    <type>
      <types>CatalogRef.КлассификаторКОАТУУ</types>
    </type>
  </attributes>
  <attributes>
    <name>Маршрут</name>
    <comment>Номер маршрута доставки (0 если не торгует)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АссортиментнаяМатрица</name>
    <type>
      <types>CatalogRef.АссортиментнаяМатрица</types>
    </type>
  </attributes>
  <attributes>
    <name>АлкоголемНеТоргуем</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешительныеДокументы</name>
    <comment>Наличие разрешительных документов по ПБ</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорСистемаАПС</name>
    <comment>Договор на обслуживание системы АПС</comment>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>ДействуетС</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Потребители</name>
    <comment>Потребители коммунальных услуг</comment>
    <attributes>
      <name>Потребитель</name>
      <comment>Потребитель коммунальных услуг</comment>
      <type>
        <types>DefinedType.ПотребительКоммунальныхУслуг</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РекламныеПлоскости</name>
    <attributes>
      <name>Расположение</name>
      <type>
        <types>EnumRef.ПлоскостьПодРекламу</types>
      </type>
    </attributes>
    <attributes>
      <name>РекламныйНоситель</name>
      <type>
        <types>CatalogRef.РекламныеНосители</types>
      </type>
    </attributes>
    <attributes>
      <name>Сюжет</name>
      <type>
        <types>CatalogRef.СюжетыРекламныхНосителей</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ширина</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОборудованиеПоставщиков</name>
    <attributes>
      <name>Оборудование</name>
      <type>
        <types>CatalogRef.ОборудованиеПоставщиков</types>
      </type>
    </attributes>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоНапитков</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Чай</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИнвентарныйНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>IMEI_1</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>IMEI_2</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоДверей</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаУстановки</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаВывоза</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Огнетушители</name>
    <attributes>
      <name>Огнетушитель</name>
      <type>
        <types>EnumRef.ТипыОгнетушителей</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаТО</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаСледующегоТО</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

AUTO_config_TK_pesok/src/Catalogs/РолиСервисДеск/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.ПользователиГруппаИнфо.Видимость = _ВидимостьГруппаИнфо;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКураторамиНаСервере()
	Проверка = Истина;
	МассивПользователей = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ТорговыеПлощадкиДополнительныеРеквизиты.Значение КАК Пользователь,
	|	ИСТИНА КАК ЭтоКуратор
	|ИЗ
	|	Справочник.ТорговыеПлощадки.ДополнительныеРеквизиты КАК ТорговыеПлощадкиДополнительныеРеквизиты
	|ГДЕ
	|	ТорговыеПлощадкиДополнительныеРеквизиты.Свойство.Имя = ""КураторПлощадки""
	|
	|УПОРЯДОЧИТЬ ПО
	|	Пользователь
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Пользователь = Новый Структура();
		Пользователь.Вставить("Наименование",(Выборка.Пользователь.Наименование));
		Пользователь.Вставить("КодПоДРФО",СокрЛП(Выборка.Пользователь.Код));
		Пользователь.Вставить("ЭтоКуратор",Неопределено);
		МассивПользователей.Добавить(Пользователь);
	КонецЦикла;
	
	ЗаписьJSON = Новый ЗаписьJSON; 
	ЗаписьJSON.УстановитьСтроку(); 
	ЗаписатьJSON(ЗаписьJSON, МассивПользователей); 
	СтрокаJSON = ЗаписьJSON.Закрыть();
	
	Определение = Новый WSОпределения("https://orders-1c.digma.ua/zuUU/ws/cwd2.1cws?wsdl","ObmenSSL","bynthghbpf",,,Новый ЗащищенноеСоединениеOpenSSL(Неопределено,Неопределено));	
	WS = Новый WSПрокси(Определение,"http://www.digma.ua","CommunicationWithDatabases","CommunicationWithDatabasesSoap",,,Новый ЗащищенноеСоединениеOpenSSL(Неопределено,Неопределено));
	WS.Пользователь="ObmenSSL";
	WS.Пароль ="bynthghbpf";
	
	Рез = WS.RegisterVisitors(СтрокаJSON, Проверка);
	
	Чтение = Новый ЧтениеJSON;
	Чтение.УстановитьСтроку(Рез);
	ОтветРезультат = ПрочитатьJSON(Чтение);
	
	Объект.Сотрудники.Очистить();
	
	Для Каждого стрСотрудник Из ОтветРезультат Цикл
		Работает = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(стрСотрудник, "ДоступРазрешен", Ложь);
		Если Работает Тогда
			стр = Объект.Сотрудники.Добавить();
			ЗаполнитьЗначенияСвойств(стр,стрСотрудник,"Должность");
			стр.Работает = Работает;
			стр.Сотрудник = Справочники.ФизическиеЛица.НайтиПоКоду(стрСотрудник.КодПоДРФО);
		КонецЕсли;
	КонецЦикла;
	_ВидимостьГруппаИнфо = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьКураторами(Команда)
	ЗаполнитьКураторамиНаСервере();
	Элементы.ПользователиГруппаИнфо.Видимость = _ВидимостьГруппаИнфо;
КонецПроцедуры

&НаСервере
Процедура ПроверитьРаботающихНаСервере()
	Проверка = Истина;
	
	Определение = Новый WSОпределения("https://orders-1c.digma.ua/zuUU/ws/cwd2.1cws?wsdl","ObmenSSL","bynthghbpf",,,Новый ЗащищенноеСоединениеOpenSSL(Неопределено,Неопределено));	
	WS = Новый WSПрокси(Определение,"http://www.digma.ua","CommunicationWithDatabases","CommunicationWithDatabasesSoap",,,Новый ЗащищенноеСоединениеOpenSSL(Неопределено,Неопределено));
	WS.Пользователь="ObmenSSL";
	WS.Пароль ="bynthghbpf";
	
	МассивСотрудников = Новый Массив;
	
	Для Каждого стрСотрудник Из Объект.Сотрудники Цикл
		Сотрудник = Новый Структура();
		Сотрудник.Вставить("Наименование",(стрСотрудник.Сотрудник.Наименование));
		//Сотрудник.Вставить("ДоступРазрешен",стрПосетитель.ДоступРазрешен);
		Сотрудник.Вставить("КодПоДРФО",СокрЛП(стрСотрудник.Сотрудник.Код));
		//Сотрудник.Вставить("ТелефонТК",СокрЛП(стрПосетитель.Телефон));
		Сотрудник.Вставить("ЭтоКуратор",Неопределено);
		МассивСотрудников.Добавить(Сотрудник);
	КонецЦикла;
	
	ЗаписьJSON = Новый ЗаписьJSON; 
	ЗаписьJSON.УстановитьСтроку(); 
	ЗаписатьJSON(ЗаписьJSON, МассивСотрудников); 
	СтрокаJSON = ЗаписьJSON.Закрыть();
	
	Рез = WS.RegisterVisitors(СтрокаJSON, Проверка);
	
	Чтение = Новый ЧтениеJSON;
	Чтение.УстановитьСтроку(Рез);
	ОтветРезультат = ПрочитатьJSON(Чтение);
	
	Объект.Сотрудники.Очистить();
	Если Проверка Тогда
		ОтветМассивПосетителей = ОтветРезультат;
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОтветРезультат.Результат.Description);
		ОтветМассивПосетителей = ОтветРезультат.МассивПользователей;
	КонецЕсли;
	
	Для Каждого стрСотрудник Из ОтветМассивПосетителей Цикл
		стр = Объект.Сотрудники.Добавить();
		ЗаполнитьЗначенияСвойств(стр,стрСотрудник);
		стр.Работает = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(стрСотрудник, "ДоступРазрешен",Ложь);
		стр.Сотрудник = Справочники.ФизическиеЛица.НайтиПоКоду(стрСотрудник.КодПоДРФО);
	КонецЦикла;
	_ВидимостьГруппаИнфо = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьРаботающих(Команда)
	ПроверитьРаботающихНаСервере();
	Элементы.ПользователиГруппаИнфо.Видимость = _ВидимостьГруппаИнфо;
КонецПроцедуры
